{
  "tableOfContent": "Table of Contents",
  "step1": {
    "title": "Step 1: Rent a Server",
    "description": "To set up your X1 Validator, you need a server, which you can rent from various providers on a monthly basis. If you already have a server that meets the minimum requirements, you can skip this step. Otherwise, continue with:",
    "buttonText": "Rent Server"
  },
  "step2": {
    "title": "Step 2: Access to server (Windows)",
    "description": "If you are using Windows as your operating system, you will need the PuTTY program to access the server. If you already have PuTTY, you can skip this step. Otherwise, continue with:"
  },
  "step3": {
    "title": "Step 3: Connect to Server and add User",
    "description": "Open your PuTTY program and enter the IP address of the server there.",
    "p01": "First, we need to log in with the username “root” in order to create a new username. If you followed the step-by-step instructions under “Rent a server”, enter the password you set with InterServer. Please note that when entering the password in PuTTY, it will not be displayed! Type in the password and press Enter.",
    "p02": "Once we have logged into the server, we create a new user. In this example, I am creating the user “test”. We will set up the validator under this user name in step 4.",
    "p03": "1. Use the command: adduser yourusername",
    "p04": "2. Next, you must assign a password for the new user.",
    "p05": "Next, you will be asked if you want to store additional information for the new user.",
    "p06": "1. Simply press Enter several times.",
    "p07": "2. Confirm your entry with “Y”.",
    "p08": "In the next step, our new user will be granted administrative rights.",
    "p09": "3. sudo usermod -aG sudo yourusername",
    "p10": "Confirm with Enter. You can then either close PuTTY or enter “exit”.",
    "p11": "Restart PuTTY, enter your IP address and connect to the server.",
    "p12": "Log in with your new username.",
    "p13": "You will now see that you are logged in under the new user name. This is shown by the green arrow at the bottom of the image."
  },
  "step4": {
    "title": "Step 4: Start Validation",
    "description": "Congratulations, you are just one step away from setting up your X1 Validator.",
    "p01": "We will now begin by copying the X1 Console from <telegramLink>BlackBeard</telegramLink>. A helpful tip: You can paste either by right-clicking or by pressing Shift+Insert.",
    "p02": "1. To do this, enter the following in the terminal (PuTTY):",
    "p03": "git clone https://github.com/BlackBeard085/x1console.git && cd x1console",
    "p04": "2. Once the copy has been created, you can install the X1 Console on your server using the following command:",
    "p05": "./x1console.sh",
    "p06": "3. It takes about 30 seconds before you are asked for the password. Enter the password you set to access the server.",
    "p07": "After installing the console, it will run automatically. Press Enter once, and you should see the same window as shown in the image below.",
    "p08": "1. Type “10” to select the “Other” menu and confirm with Enter.",
    "p09": "Now let's start installing the validator.",
    "p10": "1. To do this, select menu 1.",
    "p11": "Occasionally, a pink screen will appear. In this case, simply press the Enter key.",
    "p12": "Now pay close attention!",
    "p13": "1. If you lose access to the server, you will also lose access to your wallet. To avoid this, make a note of the seed phrase for each individual wallet – four in total. If, like me, you only see two wallets in your terminal window, simply scroll up. You do not need to write down the “pubkey” address manually, as you can find it in the X1 Console at any time.",
    "p14": "2. Once you have noted down your seed phrases for the respective wallets, your “id” wallet needs XNT. To do this, go to the <telegramLink>Faucet website<telegramLink>.",
    "p15": "If the faucet is empty, you still have the option of asking the <telegramLink>Validator Telegram Group</telegramLink> to send you XNT. Simply write your pubkey/address from the ID wallet in the chat and ask for XNT.",
    "p16": "Alternatively, you can also contact me directly in the Telegram group <telegramLink>X1BlockchainGuide</telegramLink>.",
    "p17": "Press the Enter key and continue with the installation. You can also complete the installation without XNT.",
    "p18": "Once the installation is complete, we need to make the PATH changes. To do this, we exit the menu shown and the X1 Console.",
    "p19": "1. Next, enter the following code in the terminal:",
    "p20": "export PATH='$HOME/.local/share/solana/install/active_release/bin:$PATH'",
    "p21": "2. We can now reopen the X1 Console with the following command in the terminal:",
    "p22": "./x1console.sh",
    "p23": "If you haven't skipped the step of obtaining XNT from the faucet or via Telegram, your status should be “Active”.",
    "p24": "Congratulations. You have successfully set up your own X1 blockchain validator."
  },
  "step5": {
    "title": "Step 5: Delinquent status",
    "description": "If you skipped the step with the XNT, take a look at the next image.",
    "p01": "If your status is “Delinquent”, your ID Wallet must have at least 1 XNT. You can check whether you have already received XNT from the faucet or a user under “3. Check Balance”.",
    "p02": "1. Once you have access to XNT, select “Health Check and Start Validator”. After the health check, your validator should have the status “Active”.",
    "p03": "If you close the terminal, you can access the X1 Console after logging in to your server with the following command:",
    "p04": "cd x1console && ./x1console.sh",
    "p05": "Did this guide help you? Support further development with a small donation. Every amount helps, thank you!"
  }
}