{
  "tableOfContent": "Inhaltsangabe",
  "step1": {
    "title": "Schritt 1: Server mieten",
    "description": "Um deinen X1 Validator einzurichten, benötigst du einen Server, den man bei verschiedenen Anbietern monatlich mieten kann. Wenn du bereits einen Server hast, der den Mindestanforderungen entspricht, kannst du diesen Schritt überspringen. Andernfalls fahre fort mit:",
    "buttonText": "Server mieten"
  },
  "step2": {
    "title": "Schritt 2: Zugriff auf Server (Windows)",
    "description": "Wenn du Windows als Betriebssystem nutzt, benötigst du das Programm PuTTY, um auf den Server zugreifen zu können. Solltest du PuTTY bereits haben, kannst du diesen Schritt überspringen. Andernfalls fahre fort mit:"
  },
  "step3": {
    "title": "Schritt 3: Mit Server verbinden und neuen Benutzer anlegen",
    "description": "Öffne dein PuTTY Programm und gib dort die IP Adresse von dem Server ein.",
    "p01": "Zuerst müssen wir uns mit dem Benutzernamen 'root' anmelden, um einen neuen Benutzernamen anlegen zu können. Wenn du der Schritt-für-Schritt-Anleitung unter 'Server mieten' gefolgt bist, gib das Passwort ein, das du bei InterServer festgelegt hast. Beachte bei der Eingabe in PuTTY, dass dir die Eingabe des Passworts nicht angezeigt wird! Tippe das Passwort ein und drücke Enter.",
    "p02": "Sobald wir uns auf den Server eingeloggt haben, legen wir einen neuen Benutzer an. Im Beispiel lege ich den Benutzer 'test' an. Unter diesem Benutzernamen werden wir in Schritt 4 den Validator einrichten.",
    "p03": "1. Verwende hierzu den Befehl: adduser yourusername",
    "p04": "2. Anschließend musst du für den neuen Benutzer ein Passwort vergeben.",
    "p05": "Als nächstes wirst du gefragt, ob du dem neuen Benutzer weitere Informationen hinterlegen möchtest.",
    "p06": "1. Einfach nur mehrmals Enter drücken",
    "p07": "2. Eingabe mit 'Y' bestättigen.",
    "p08": "Im nächsten Schritt erhält unser neuer Benutzer Administrationsrechte.",
    "p09": "3. sudo usermod -aG sudo yourusername",
    "p10": "Mit Enter bestätigen. Anschließend kannst du entweder PuTTY schließen oder 'exit' eingeben.",
    "p11": "Starte erneut PuTTY, gib deine IP-Adresse ein und verbinde dich mit dem Server.",
    "p12": "Melde dich mit dem neuen Benutzernamen an.",
    "p13": "Du siehst nun, dass du unter dem neuen Benutzernamen angemeldet bist. Unten im Bild ist es mit dem grünen Pfeil dargestellt."
  },
  "step4": {
    "title": "Schritt 4: Server einrichten",
    "description": "Herzlichen Glückwunsch, dir fehlt nur noch der letzte Schritt um deinen X1 Validator einzurichten.",
    "p01": "Wir fangen nun damit an, die X1 Console von <telegramLink>BlackBeard</telegramLink> zu kopieren. Kleiner Tipp: Einfügen kannst du entweder mit einem Klick der rechten Maustaste oder mit Shift+einfg.",
    "p02": "1. Gib hierzu im Terminal (PuTTY) Folgendes ein:",
    "p03": "git clone https://github.com/BlackBeard085/x1console.git && cd x1console",
    "p04": "2. Sobald die Kopie erstellt ist, kannst du die X1 Console mit dem folgenden Befehl auf deinem Server installieren:",
    "p05": "./x1console.sh",
    "p06": "3. Es dauert ca. 30 Sekunden, bis du nach dem Passwort gefragt wirst. Gib das Passwort ein, das du festgelegt hattest, um auf den Server zuzugreifen.",
    "p07": "Nach der Installation der Console wird diese automatisch ausgeführt. Drücke einmal Enter, und dann solltest du das gleiche Fenster angezeigt bekommen wie unten im Bild.",
    "p08": "1. Tippe '10' ein, um das Menü 'Other' anzuwählen, und bestätige mit Enter.",
    "p09": "Nun fangen wir an, den Validator zu installieren.",
    "p10": "1. Wähle hierzu das Menü 1 aus.",
    "p11": "Hin und wieder erscheint ein rosafarbener Bildschirm. In so einem Fall drücke einfach die Taste Enter.",
    "p12": "Jetzt bitte sehr gut aufpassen!",
    "p13": "1. Solltest du mal den Zugang zum Server verlieren, dann verlierst du auch den Zugang zu deiner Wallet. Um das zu vermeiden, notiere dir die Seed Phrase jeder einzelnen Wallet – in Summe 4 Stück. Solltest du in deinem Terminalfenster, wie ich, nur 2 Wallets sehen, scrolle dann einfach hoch. Die Adresse 'pubkey' musst du nicht händisch abschreiben, weil du diese in der X1 Console jederzeit wiederfinden kannst.",
    "p14": "2. Sobald du dir deine Seed-Phrasen zu den jeweiligen Wallets notiert hast, benötigt deine 'id' Wallet XNT. Gehe hierzu auf die <telegramLink>Faucet-Webseite<telegramLink>.",
    "p15": "Sollte das Faucet leer sein, gibt es noch die Option, in der <telegramLink>Validator Telegram Gruppe</telegramLink> darum zu bitten, dass dir XNT zugesendet wird. Schreibe hierzu einfach in den Chat deine Pubkey/Adresse von der ID Wallet und bitte um XNT.",
    "p16": "Alternativ kannst du mich auch direkt kontaktieren in der Telegram-Gruppe <telegramLink>X1BlockchainGuide</telegramLink>.",
    "p17": "Drücke die Taste Enter und fahre mit der Installation fort. Die Installation kannst du auch ohne XNT abschließen.",
    "p18": "Sobald die Installation abgeschlossen ist, müssen wir die PATH-Änderungen durchführen. Hierzu beenden wir das dargestellte Menü und die X1 Console.",
    "p19": "1. Anschließend geben wir folgenden Code im Terminal ein:",
    "p20": "export PATH='$HOME/.local/share/solana/install/active_release/bin:$PATH'",
    "p21": "2. Wir können nun die X1 Console wieder mit dem folgenden Befehl im Terminal öffnen:",
    "p22": "./x1console.sh",
    "p23": "Wenn du den Schritt nicht übersprungen hast, dir XNT vom Faucet zu besorgen oder über Telegram, dann sollte bei dir der Status 'Active' sein.",
    "p24": "Herzlichen Glückwunsch. Du hast es geschafft, dir deinen eigenen X1 Blockchain Validator einzurichten."
  },
  "step5": {
    "title": "Schritt 5: Status Delinquent",
    "description": "Solltest du den Schritt mit dem XNT übersprungen haben, dann schau dir das nächste Bild an.",
    "p01": "Wenn dein Status 'Delinquent' ist, dann benötigt deine ID Wallet mindestens 1 XNT. Ob du bereits die XNT vom Faucet oder einem User erhalten hast, kannst du unter '3. Check Balance' nachschauen.",
    "p02": "1. Sobald dir die XNT zur Verfügung stehen, wähle 'Health Check and Start Validator' aus. Nach dem Health Check sollte dein Validator den Status 'Active' haben.",
    "p03": "Solltest du das Terminal schließen, dann kannst du auf die X1 Console, nach dem Login auf deinen Server, mit folgendem Befehl zugreifen:",
    "p04": "cd x1console && ./x1console.sh",
    "p05": "Hat dir diese Anleitung geholfen? Unterstütze die Weiterentwicklung mit einer kleinen Spende. Jeder Betrag hilft, danke!"
  }
}