{
  "tableOfContent": "Inhaltsangabe",
  "introduction": "Einrichten eines Fernzugriffes",
  "p01": "PuTTY ermöglicht es, sich über SSH (Secure Shell) sicher mit entfernten Linux-Servern oder anderen Geräten zu verbinden, um sie zu verwalten oder Befehle auszuführen. Wir werden das Programm nutzen, um auf dem Server den X1 Blockchain Validator einzurichten.",
  "p02": "Gehe hierzu auf die <telegramLink>Webseite von PuTTY</telegramLink>.",
  "step1": {
      "title": "Schritt 1: Download und Installation",
      "p01": "Lade die Datei herunter und installiere das Programm."
    },
  "step2": {
      "title": "Schritt 2: Programm öffnen",
      "p01": "Sobald du es geöffnet hast, sollte es so aussehen wie im Bild unten dargestellt. Du hast nun ein Programm, mit dem du auf deinen neuen Server zugreifen kannst."
  },
  "step3": {
    "title": "Schritt 3: Mit Server verbinden und neuen Benutzer anlegen",
    "p01": "In dem PuTTY Programm gibst du nun die IP Adresse von dem Server ein. Wenn du einen Server von InterServer hast, dann findest du die IP Adresse unter 'Servers'. Kleiner Tipp: Kopierten Code kannst du ganz einfach in das Terminal einfügen entweder mit einem Klick der rechten Maustaste oder mit Shift+einfg.",
    "p02": "Zuerst müssen wir uns mit dem Benutzernamen 'root' anmelden, um einen neuen Benutzernamen anlegen zu können. Wenn du der Schritt-für-Schritt-Anleitung unter 'Server mieten' gefolgt bist, gib das Passwort ein, das du bei InterServer festgelegt hast. Beachte bei der Eingabe in PuTTY, dass dir die Eingabe des Passworts nicht angezeigt wird! Tippe das Passwort ein und drücke Enter.",
    "p03": "Sobald wir uns auf den Server eingeloggt haben, legen wir einen neuen Benutzer an. Im Beispiel lege ich den Benutzer 'test' an. Unter diesem Benutzernamen werden wir in Schritt 4 den Validator einrichten.",
    "p04": "1. Verwende hierzu den Befehl 'adduser username' und ersetzte 'username' gegen einen Benutzernamen deiner Wahl.",
    "p05":"adduser username",
    "p06": "2. Anschließend musst du für den neuen Benutzer ein Passwort vergeben.",
    "p07": "Als nächstes wirst du gefragt, ob du dem neuen Benutzer weitere Informationen hinterlegen möchtest.",
    "p08": "1. Einfach nur mehrmals Enter drücken",
    "p09": "2. Eingabe mit 'Y' bestättigen.",
    "p10": "Im nächsten Schritt erhält unser neuer Benutzer Administrationsrechte.",
    "p11": "sudo usermod -aG sudo username",
    "p12": "Mit Enter bestätigen und anschließend kannst du entweder PuTTY schließen oder 'exit' eingeben.",
    "p13": "Starte erneut PuTTY, gib deine IP-Adresse ein und verbinde dich mit dem Server. Melde dich mit dem neuen Benutzernamen an. Du siehst nun, dass du unter dem neuen Benutzernamen angemeldet bist. Unten im Bild ist es mit dem grünen Pfeil dargestellt. Du kannst als nächstes mit dem <telegramLink>Main Guide</telegramLink> fortfahren."
  }
}